src/main/resources/enrollment/Creating subscription.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enr="http://www.healthedge.com/connector/schema/enrollmentsparse">
   <soapenv:Header/>
   <soapenv:Body>
      <enr:enrollment>
         <actionMode>SPARSE</actionMode>
         <asOfDate>2020-01-01</asOfDate>
         <sendToWorkBasketIfExceptionsPresent>true</sendToWorkBasketIfExceptionsPresent>
         <subscription>
            <maintenanceReasonCode>
               <codeSetName>SubscriptionCreateReason</codeSetName>
               <codeEntry>1</codeEntry>
            </maintenanceReasonCode>
            <maintenanceComment>SOAPUI_Test_BN</maintenanceComment>
            <receiptDate>2020-10-13</receiptDate>
             <accountMatchData>
               <accountHccIdentifier>
                  <accountHccIdentificationNumber>0001-003</accountHccIdentificationNumber>
               </accountHccIdentifier>
            </accountMatchData>
            <subsidy>
               <subscriptionHccId/>
               <otherBillRecipientHccId>M377668100</otherBillRecipientHccId>
               <benefitPlanTypeCode>
                  <codeSetName>BenefitPlanType</codeSetName>
                  <codeEntry>1</codeEntry>
               </benefitPlanTypeCode>
               <billingCategoryCode>
                  <codeSetName>BillingCategory</codeSetName>
                  <codeEntry>PREM</codeEntry>
               </billingCategoryCode>
               <dateRanges>
                  <dateRange>
                     <startDate>2020-09-01</startDate>
                     <throughDate>2023-01-01</throughDate>
                     <amount>0.0</amount>
                  </dateRange>
               </dateRanges>
            </subsidy>
            <applicationInfo>
               <ratingArea>R-MN006</ratingArea>
            </applicationInfo>
         </subscription>
         <member>
            <maintenanceTypeCode>CREATE</maintenanceTypeCode>
            <memberIsSubscriber>true</memberIsSubscriber>
            <receiptDate>2020-10-13</receiptDate>
            <smokingStatus>Non Smoker</smokingStatus>
            <memberMatchData>
               <definitionName>MemberMatchDefinition</definitionName>
            </memberMatchData>
            <individual>
               <taxIdentificationNumber>365-02-7912</taxIdentificationNumber>
               <genderCode>Male</genderCode>
               <maritalStatusCode>Married</maritalStatusCode>
               <birthDate>1980-03-21</birthDate>
               <primaryName>
                  <lastName>Flintstone</lastName>
                  <firstName>jhon1234</firstName>
                  <middleName/>
               </primaryName>
            </individual>
            <physicalAddress>
               <memberPhysicalAddress>
                  <addressInfo>
                     <postalAddress>
                        <address>602 Roiland St</address>
                        <stateCode>MN</stateCode>
                        <zipCode>56381</zipCode>
                        <cityName>Starbuck</cityName>
                        <countyCode>27121</countyCode>
                     </postalAddress>
                     <addressPhoneList>
                        <telephoneNumber>
                           <phoneAreaCode>320</phoneAreaCode>
                           <phoneNumber>4240592</phoneNumber>
                           <individualPhoneTypeCode>
                              <codeSetName>IndividualTypeCode</codeSetName>
                              <codeEntry>TE</codeEntry>
                           </individualPhoneTypeCode>
                        </telephoneNumber>
                     </addressPhoneList>
                  </addressInfo>
                  <addressTypeCode>
                     <codeSetName>IndividualAddressType</codeSetName>
                     <shortName>Residential</shortName>
                  </addressTypeCode>
               </memberPhysicalAddress>
               <memberPhysicalAddress>
                  <addressInfo>
                     <postalAddress>
                        <address>602 Roiland St</address>
                        <stateCode>MN</stateCode>
                        <zipCode>56381</zipCode>
                        <cityName>Starbuck</cityName>
                     </postalAddress>
                     <addressPhoneList>
                        <telephoneNumber>
                           <phoneAreaCode>320</phoneAreaCode>
                           <phoneNumber>4240592</phoneNumber>
                           <individualPhoneTypeCode>
                              <codeSetName>IndividualTypeCode</codeSetName>
                              <codeEntry>TE</codeEntry>
                           </individualPhoneTypeCode>
                        </telephoneNumber>
                     </addressPhoneList>
                  </addressInfo>
                  <addressTypeCode>
                     <codeSetName>IndividualAddressType</codeSetName>
                     <shortName>Subscription Billing Address</shortName>
                  </addressTypeCode>
               </memberPhysicalAddress>
            </physicalAddress>
            <correspondenceAddress>
               <postalAddress>
                  <address>602 Roiland St</address>
                  <stateCode>MN</stateCode>
                  <zipCode>56381</zipCode>
                  <cityName>Starbuck</cityName>
               </postalAddress>
            </correspondenceAddress>
            <otherResponsiblePersonInfo/>
            <relationshipToSubscriberDefinitionReference>
               <relationshipName>Self</relationshipName>
            </relationshipToSubscriberDefinitionReference>
            <raceOrEthnicity/>
            <planSelection>
               <startDate>2020-01-01</startDate>
               <benefitPlanMatchData>
                  <benefitPlanHccId>HMK 2020</benefitPlanHccId>
               </benefitPlanMatchData>
            </planSelection>
            <reportingCategory counter="0">
               <reportingCategoryName>TOT RES AMT</reportingCategoryName>
               <amount>331.18</amount>
               <startDate>2020-09-01</startDate>
            </reportingCategory>
            <reportingCategory counter="0">
               <reportingCategoryName>RATING AREA</reportingCategoryName>
               <referenceId>R-MN006</referenceId>
               <amount>0.0</amount>
               <startDate>2020-09-01</startDate>
            </reportingCategory>
         </member>
      </enr:enrollment>
   </soapenv:Body>
</soapenv:Envelope>