src/main/resources/Enrollement_data2.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enr="http://www.healthedge.com/connector/schema/enrollmentsparse">   
   <soapenv:Header/>
   <soapenv:Body>
      <enr:enrollment>
         <actionMode>SPARSE</actionMode>
         <asOfDate>2021-01-01</asOfDate>
         <!--subscriberId>00213144</subscriberId-->
         <sendToWorkBasketIfExceptionsPresent>true</sendToWorkBasketIfExceptionsPresent>
         <subscription>
            <maintenanceReasonCode>
               <codeSetName>SubscriptionCreateReason</codeSetName>
               <codeEntry>1</codeEntry>
            </maintenanceReasonCode>
            <maintenanceComment>SOAPUI_Test_BN</maintenanceComment>
            <!--subscriptionIdentifier>00213144</subscriptionIdentifier-->
            <hccIdentifier>00889872</hccIdentifier>
            <receiptDate>2022-05-01</receiptDate>
            <subscriptionUDTList>
               <subscriptionUDT>
                  <udtListValueSet>
                     <attributeRoleName>EMAAS Medical Eligibility Codes</attributeRoleName>
                     <attrValueAsString>ME Code 93</attrValueAsString>
                  </udtListValueSet>
                  <userDefinedTermReference>
                     <ID>EMAAS Medical Eligibility Code</ID>
                  </userDefinedTermReference>
               </subscriptionUDT>
            </subscriptionUDTList>
            <accountMatchData>
               <accountHccIdentifier>
                  <accountHccIdentificationNumber>0000000061</accountHccIdentificationNumber>
               </accountHccIdentifier>
            </accountMatchData>
            <subsidy>
               <subscriptionHccId/>
               <otherBillRecipientHccId>M377668100</otherBillRecipientHccId>
               <benefitPlanTypeCode>
                  <codeSetName>BenefitPlanType</codeSetName>
                  <codeEntry>1</codeEntry>
               </benefitPlanTypeCode>
               <billingCategoryCode>
                  <codeSetName>BillingCategory</codeSetName>
                  <codeEntry>PREM</codeEntry>
               </billingCategoryCode>
               <dateRanges>
                  <dateRange>
                     <startDate>2021-08-01</startDate>
                     <throughDate>3000-01-01</throughDate>
                     <amount>0.0</amount>
                  </dateRange>
               </dateRanges>
            </subsidy>
            <applicationInfo>
               <ratingArea>R-MN006</ratingArea>
            </applicationInfo>
         </subscription>
         <member>
            <maintenanceTypeCode>CREATE</maintenanceTypeCode>
            <memberIsSubscriber>true</memberIsSubscriber>
            <hccIdentifier>00889872</hccIdentifier>
            <receiptDate>2022-05-01</receiptDate>
            <smokingStatus>Smoker</smokingStatus>
            <memberMatchData>
               <definitionName>MemberMatchDefinition</definitionName>
            </memberMatchData>
            <individual>
               <taxIdentificationNumber>365-02-7912</taxIdentificationNumber>
               <genderCode>F</genderCode>
               <maritalStatusCode>Married</maritalStatusCode>
               <birthDate>1969-01-03</birthDate>
               <primaryName>
                  <lastName>EUISPA</lastName>
                  <firstName>JEEN</firstName>
                  <middleName/>
               </primaryName>
            </individual>
            <physicalAddress>
               <memberPhysicalAddress>
                  <addressInfo>
                     <postalAddress>
                        <address>231 OAK ROAD</address>
                        <stateCode>MO</stateCode>
                        <zipCode>3834</zipCode>
                        <cityName>harleston</cityName>
                        <countyCode>M3</countyCode>
                     </postalAddress>
                     <addressPhoneList>
                        <telephoneNumber>
                           <phoneAreaCode>320</phoneAreaCode>
                           <phoneNumber>4240592</phoneNumber>
                           <individualPhoneTypeCode>
                              <codeSetName>IndividualTypeCode</codeSetName>
                              <codeEntry>TE</codeEntry>
                           </individualPhoneTypeCode>
                        </telephoneNumber>
                     </addressPhoneList>
                  </addressInfo>
                  <addressTypeCode>
                     <codeSetName>IndividualAddressType</codeSetName>
                     <shortName>Residential</shortName>
                  </addressTypeCode>
               </memberPhysicalAddress>
               <memberPhysicalAddress>
                  <addressInfo>
                     <postalAddress>
                        <address>231 OAK ROAD</address>
                        <stateCode>MO</stateCode>
                        <zipCode>3834</zipCode>
                        <cityName>harleston</cityName>
                     </postalAddress>
                     <addressPhoneList>
                        <telephoneNumber>
                           <phoneAreaCode>320</phoneAreaCode>
                           <phoneNumber>4240592</phoneNumber>
                           <individualPhoneTypeCode>
                              <codeSetName>IndividualTypeCode</codeSetName>
                              <codeEntry>TE</codeEntry>
                           </individualPhoneTypeCode>
                        </telephoneNumber>
                     </addressPhoneList>
                  </addressInfo>
                  <addressTypeCode>
                     <codeSetName>IndividualAddressType</codeSetName>
                     <shortName>Subscription Billing Address</shortName>
                  </addressTypeCode>
               </memberPhysicalAddress>
            </physicalAddress>
            <correspondenceAddress>
               <postalAddress>
                  <address>231 OAK ROAD</address>
                  <stateCode>MO</stateCode>
                  <zipCode>3834</zipCode>
                  <cityName>harleston</cityName>
               </postalAddress>
            </correspondenceAddress>
            <otherResponsiblePersonInfo/>
            <!--memberRepresentative>              
               <authorizedIndividual>                 
                  <authorizedPerson>
                     <lastName>QUISPE</lastName>
                     <firstName>JEAN  A</firstName>                   
                  </authorizedPerson>   
                  </authorizedIndividual>              
            </memberRepresentative-->
            <membershipUDTList>
               <membershipUDT>
                  <udtListValueSet>
                     <attributeRoleName>EMAAS Medical Eligibility Codes</attributeRoleName>
                     <attrValueAsString>ME Code 93</attrValueAsString>
                  </udtListValueSet>
                  <userDefinedTermReference>
                     <ID>EMAAS Medical Eligibility Code</ID>
                  </userDefinedTermReference>
               </membershipUDT>
            </membershipUDTList>
            <relationshipToSubscriberDefinitionReference>
               <relationshipName>Self</relationshipName>
            </relationshipToSubscriberDefinitionReference>
            <raceOrEthnicity/>
            <planSelection>
               <startDate>2021-08-01</startDate>
               <benefitPlanMatchData>
                  <benefitPlanHccId>EMaaS Test AK</benefitPlanHccId>
               </benefitPlanMatchData>
            </planSelection>
            <providerSelections>             
               <providerSelection>
                  <providerRoleType>15</providerRoleType>
                  <providerDateRanges>
                     <startDate>2021-08-01</startDate>
                     <endDate>2022-09-29</endDate>
                     <providerMatch>
                        <!--asOfDate>?</asOfDate-->
                        <supplier>                          
                           <hccIdentificationNumber>0001</hccIdentificationNumber>
                        </supplier>                                                
                     </providerMatch>
                     <providerSelectionReason>
                        <codeSetName>providerSelectionReason</codeSetName>
                        <codeEntry>1</codeEntry>
                        <!--shortName>Auto Assigned</shortName-->
                     </providerSelectionReason>
                  </providerDateRanges>
               </providerSelection>
            </providerSelections>
            <memberComplianceProgram>
               <complianceProgramSelections>
                  <!--updateMode>?</updateMode-->
                  <complianceProgramSelection>
                     <complianceProgramDateRanges>
                        <startDate>2021-08-01</startDate>
                        <endDate>2022-09-29</endDate>
                       <complianceCode>C</complianceCode>
                     </complianceProgramDateRanges>
                     <complianceProgramReference>
                        <ID>EMaaS Administrative Lock In - Clinic</ID>
                     </complianceProgramReference>
                  </complianceProgramSelection>
               </complianceProgramSelections>
            </memberComplianceProgram>
         </member>
      </enr:enrollment>
   </soapenv:Body>
</soapenv:Envelope>